---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.DisabledDisciplineException
source: html/fee9d4b7-d047-5755-12fd-43d9458187e3.htm
---
# DisabledDisciplineException Members

Retrieves data needed to serialize the target object.